<template>
	<div class="activity playWarp">
		<div class="banner"></div>
		<div class="activityWarp">
			<div class="contentMain activityMain clearfix bgcolorA">

					<div class="contMain clearfix fl" >
						<div class="mainLeftBar fl clearfix">

							<ul class=" ft16 mainLeftBarList clearfix fr" id="mainLeftBarList">
								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe699;</i></span>
									<span class="mainLeftBarTxt">时时彩</span>
								</li>

								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe690;</i></span>
									<span class="mainLeftBarTxt">十一选五</span>
								</li>
								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe694;</i></span>
									<span class="mainLeftBarTxt">快三</span>
								</li>
								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe68f;</i></span>
									<span class="mainLeftBarTxt">3D福彩</span>
								</li>
								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe692;</i></span>
									<span class="mainLeftBarTxt">PK10</span>
								</li>
								<li class="colorJ cursor ">
									<span class="mainLeftBarIcon "><i class="icon colory ft44">&#xe692;</i></span>
									<span class="mainLeftBarTxt">六合彩</span>
								</li>

							</ul>
						</div>

						<div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">时时彩</h2>
									<p class="mt25">
										时时彩是一种经中国财务部批准，福利彩票发行中心承销的福彩快开彩票，其特点有玩法简单、中奖率高、开奖快、既买既兑、赔率设奖等特点。
									</p>
									<table class="mainRightBarMain bgcolorA mt10 ft12" border="2" cellspacing="2" cellpadding="2">
										<tr>
											<th style="width:20%; ">玩法组</th>
											<th style="width:20%;">玩法</th>
											<th style="width:60%;">介绍</th>
										</tr>
										<tr>
											<td rowspan="2">五星直选</td>
											<td>直选复式</td>
											<td class="contLeft">从万位、千位、百位、十位、个位中选择一个5位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个5位数号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>


										<tr>
											<td rowspan="2">四星直选</td>
											<td>直选复式</td>
											<td class="contLeft">从千位、百位、十位、个位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个4位数号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="2">前三直选</td>
											<td>直选复式</td>
											<td class="contLeft">从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个3位数号码组成一注，所选号码与开奖号码的万位、千位、百位相同，且顺序一致，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="2">中三直选</td>
											<td>直选复式</td>
											<td class="contLeft">	从千位、百位、十位中选择一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个3位数号码组成一注，所选号码与开奖号码的千位、百位、十位相同，且顺序一致，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="2">后三直选</td>
											<td>直选复式</td>
											<td class="contLeft">从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个3位数号码组成一注，所选号码与开奖号码的百位、十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">前三组选</td>
											<td>组三</td>
											<td class="contLeft">0-9中任意选择2个号码组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>组六</td>
											<td class="contLeft">从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>混合组选</td>
											<td class="contLeft">键盘手动输入购买号码，3个数字为一注，开奖号码的万位、千位、百位符合前三的组三或组六均为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">中三组选</td>
											<td>组三</td>
											<td class="contLeft">0-9中任意选择2个号码组成两注，所选号码与开奖号码的千位、百位、十位相同，且顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>组六</td>
											<td class="contLeft">从0-9中任意选择3个号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>混合组选</td>
											<td class="contLeft">键盘手动输入购买号码，3个数字为一注，开奖号码的千位、百位、十位符合中三的组三或组六均为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">后三组选</td>
											<td>组三</td>
											<td class="contLeft">0-9中任意选择2个号码组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>组六</td>
											<td class="contLeft">从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>混合组选</td>
											<td class="contLeft">键盘手动输入购买号码，3个数字为一注，开奖号码的百位、十位、个位符合后三的组三或组六均为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">不定胆</td>
											<td>前三不定胆</td>
											<td class="contLeft">从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>中三不定胆</td>
											<td class="contLeft">从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、十位中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>后三不定胆</td>
											<td class="contLeft">从0-9中选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位中包含所选号码，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="5">五星定胆</td>
											<td>万位</td>
											<td class="contLeft">从万位选择1个号码组成一注，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>千位</td>
											<td class="contLeft">从千位选择1个号码组成一注，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>百位</td>
											<td class="contLeft">从百位选择1个号码组成一注，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>十位</td>
											<td class="contLeft">从十位选择1个号码组成一注，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>个位</td>
											<td class="contLeft">从个位选择1个号码组成一注，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>

										<tr>
											<td>大小单双</td>
											<td>后二</td>
											<td class="contLeft">对十位和个位的“大（56789）小（01234）、单（13579）双（02468）”形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。</td>
										</tr>



										<tr>
											<td rowspan="8">二星</td>
											<td>前二直选复式</td>
											<td class="contLeft">从万位和千位上至少各选1个号码，所选号码与开奖号码的万位、千位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前二直选单式</td>
											<td class="contLeft">手动输入一个2位数号码组成一注，所选号码与开奖号码的万位、千位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前二组选复式</td>
											<td class="contLeft">从0-9中选2个号码组成一注，所择号码与开奖号码的万位、千位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>前二组选单式</td>
											<td class="contLeft">手动输入购买号码，2个数字为一注，所选号码与开奖号码的万位、千位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选复式</td>
											<td class="contLeft">从十位和个位上至少各选1个号码，所选号码与开奖号码的十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选单式</td>
											<td class="contLeft">手动输入一个2位数号码组成一注，所选号码与开奖号码的十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>后二组选复式</td>
											<td class="contLeft">	从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>后二组选单式</td>
											<td class="contLeft">手动输入购买号码，2个数字为一注，所选号码与开奖号码的十位、个位相同，顺序不限，即为中奖。</td>
										</tr>
									</table>
                  <h2 class="mainRightBarTitle ft36 colorY classical">经典玩法</h2>
                  <p class="ft18 classical_title">~ 第五球,单双大小，斗牛，梭哈</p>
                  <p class="common_color">第一球~第五球：</p>
                  <p>第一球、第二球、第三球、第四球、第五球：指下注的每一球与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。</p>
                  <p class="common_color">单双大小</p>
                  <p>单项投注第一球 ~ 第五球开出的球号，判断胜负。</p>
                  <p class="common_color">大小：</p>
                  <p>单项投注的第一球 ~ 第五球开出的球号大于或等于 5 为大，小于或等于 4 为小。</p>
                  <p class="common_color">单双：</p>
                  <p>单项投注的第一球 ~ 第五球开出的球号为双数则为双，如 2、6；球号为单数则为单，如 1、3。</p>
                  <p class="common_color">斗牛：开奖号码不分顺序</p>
                  <p>牛牛：根据开奖第一球 ~ 第五球开出的球号数字为基础，任意组合三个号码成0或10的倍数，取剩余两个号码之和为点数（大于10时减去10后的数字作为对奖基数，如：00026为牛8，02818为牛9，68628、23500皆为牛10俗称牛牛；26378、15286因任意三个号码都无法组合成0或10的倍数，称为没牛，注：当五个号码相同时，只有00000视为牛牛，其它11111，66666等皆视为没牛）</p>
                  <p>大小：牛大(牛6,牛7,牛8,牛9,牛牛)，牛小(牛1,牛2,牛3,牛4,牛5)，若开出斗牛结果为没牛，则投注牛大牛小皆为不中奖。</p>
                  <p>单双：牛单(牛1,牛3,牛5,牛7,牛9)，牛双(牛2,牛4,牛6,牛8,牛牛)，若开出斗牛结果为没牛，则投注牛单牛双皆为不中奖。</p>
                  <p class="common_color">梭哈：开奖号码不分顺序</p>
                  <p>五条：开奖的五个号码全部相同，例如：22222、66666、88888 投注梭哈：五条 中奖，其它不中奖。</p>
                  <p>四条：开奖的五个号码中有四个号码相同，例如：22221、66663、88885 投注梭哈：四条 中奖，其它不中奖。</p>
                  <p>葫芦：开奖的五个号码中有三个号码相同(三条)另外两个号码也相同(一对)，例如：22211、66633 投注梭哈：葫芦 中奖，其它不中奖。</p>
                  <p>顺子：开奖的五个号码从小到大排列为顺序(号码9、0、1相连)，例如：23456、89012、90123 投注梭哈：顺子 中奖，其它不中奖。</p>
                  <p>三条：开奖的五个号码中有三个号码相同另外两个不相同，例如：22231、66623、88895 投注梭哈：三条 中奖，其它不中奖。</p>
                  <p>两对：开奖的五个号码中有两组号码相同，例如：22166、66355、82668 投注梭哈：两对 中奖，其它不中奖。</p>
                  <p>一对：开奖的五个号码中只有一组号码相同，例如：22168、66315、82968 投注梭哈：一对 中奖，其它不中奖。</p>
                  <p>散号：开奖号码不是五条、四条、葫芦、三条、顺子、两对、一对的其它所有开奖号码，例如：23186、13579、21968 投注梭哈：散号 中奖，其它不中奖。</p>
                  <p class="ft18 classical_title">总和</p>
                  <p class="common_color">大小：</p>
                  <p>单项投注的第一球 ~ 第五球开出的球号数字总和值大于或等于 23 为总和大，小于或等于 22 为总和小。</p>
                  <p class="common_color">单双：</p>
                  <p>单项投注的第一球 ~ 第五球开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。</p>
                  <p>前三特殊玩法： 豹子 > 顺子 > 对子 > 半顺 > 杂六</p>
                  <p class="common_color">豹子：</p>
                  <p>开奖号码的万位千位百位数字都相同。如中奖号码为：222XX、666XX、888XX...开奖号码的万位千位百位数字相同，则投注前三豹子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">顺子：</p>
                  <p>开奖号码的万位千位百位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：123XX、901XX、321XX、798XX...开奖号码的万位千位百位数字相连，则投注前三顺子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">对子：</p>
                  <p>开奖号码的万位千位百位任意两位数字相同（不包括豹子）。如中奖号码为：001XX，288XX、696XX...开奖号码的万位千位百位有两位数字相同，则投注前三对子者视为中奖，其它视为不中奖。如果开奖号码为前三豹子，则前三对子视为不中奖。</p>
                  <p class="common_color">半顺：</p>
                  <p>开奖号码的万位千位百位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：125XX、540XX、390XX、160XX...开奖号码的万位千位百位有两位数字相连，则投注前三半顺者视为中奖，其它视为不中奖。如果开奖号码为前三顺子、前三对子，则前三半顺视为不中奖。如开奖号码为：123XX、901XX、556XX、233XX...视为不中奖。</p>
                  <p class="common_color">杂六：</p>
                  <p>不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：157XX、268XX...开奖号码位数之间无关联性，则投注前三杂六者视为中奖，其它视为不中奖。</p>
                  <p class="ft18 classical_title">中三特殊玩法： 豹子 > 顺子 > 对子 > 半顺 > 杂六</p>
                  <p class="common_color">豹子：</p>
                  <p>开奖号码的千位百位十位数字都相同。如中奖号码为：X222X、X666X、X888X...开奖号码的千位百位十位数字相同，则投注中三豹子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">顺子：</p>
                  <p>开奖号码的千位百位十位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：X123X、X901X、X321X、X798X...开奖号码的千位百位十位数字相连，则投注中三顺子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">对子：</p>
                  <p>开奖号码的千位百位十位任意两位数字相同（不包括豹子）。如中奖号码为：X001X，X288X、X696X...开奖号码的千位百位十位有两位数字相同，则投注中三对子者视为中奖，其它视为不中奖。如果开奖号码为中三豹子，则中三对子视为不中奖。</p>
                  <p class="common_color">半顺：</p>
                  <p>开奖号码的千位百位十位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：X125X、X540X、X390X、X160X...开奖号码的千位百位十位有两位数字相连，则投注中三半顺者视为中奖，其它视为不中奖。如果开奖号码为中三顺子、中三对子，则中三半顺视为不中奖。如开奖号码为：X123X、X901X、X556X、X233X...视为不中奖。</p>
                  <p class="common_color">杂六：</p>
                  <p>不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：X157X、X268X...开奖号码位数之间无关联性，则投注中三杂六者视为中奖，其它视为不中奖。</p>
                  <p class="ft18 classical_title">后三特殊玩法： 豹子 > 顺子 > 对子 > 半顺 > 杂六</p>
                  <p class="common_color">豹子：</p>
                  <p>开奖号码的百位十位个位数字都相同。如中奖号码为：XX222、XX666、XX888...开奖号码的百位十位个位数字相同，则投注后三豹子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">顺子：</p>
                  <p>开奖号码的百位十位个位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：XX123、XX901、XX321、XX798...开奖号码的百位十位个位数字相连，则投注后三顺子者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">对子：</p>
                  <p>开奖号码的百位十位个位任意两位数字相同（不包括豹子）。如中奖号码为：XX001，XX288、XX696...开奖号码的百位十位个位有两位数字相同，则投注后三对子者视为中奖，其它视为不中奖。如果开奖号码为后三豹子，则后三对子视为不中奖。</p>
                  <p class="common_color">半顺：</p>
                  <p>开奖号码的百位十位个位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：XX125、XX540、XX390、XX160...开奖号码的百位十位个位有两位数字相连，则投注后三半顺者视为中奖，其它视为不中奖。如果开奖号码为后三顺子、后三对子，则后三半顺视为不中奖。如开奖号码为：XX123、XX901、XX556、XX233...视为不中奖。</p>
                  <p class="common_color">杂六：</p>
                  <p>不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：XX157、XX268...开奖号码位数之间无关联性，则投注后三杂六者视为中奖，其它视为不中奖。</p>
                  <p class="ft18 classical_title">龙虎和特殊玩法： 龙 > 虎 > 和</p>
                  <p class="common_color">龙：</p>
                  <p>开奖第一球（万位）的号码 大于 第五球（个位）的号码。如：3XXX2、7XXX6、9XXX8...开奖为龙，投注龙者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">虎：</p>
                  <p>开奖第一球（万位）的号码 小于 第五球（个位）的号码。如：1XXX2、3XXX6、4XXX8..开奖为虎，投注虎者视为中奖，其它视为不中奖。</p>
                  <p class="common_color">和：</p>
                  <p>开奖第一球（万位）的号码 等于 第五球（个位）的号码。如：2XXX2、6XXX6、8XXX8...开奖为和，投注和者视为中奖，其它视为不中奖。</p>
                </div>
						</div>

						<div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">十一选五玩法介绍</h2>
									<p class="mt25">
										从01-11共11个号码中任选1-8个号码进行投注，每期开出5个号码为中奖号码，竞猜5位开奖号码的全部或部分号码。投注方式灵活，开奖频次高，全面满足不同彩民的投注需要。
									</p>
									<table class="mainRightBarMain bgcolorA mt10 ft12" border="2" cellspacing="2" cellpadding="2">
										<tr>
											<th style="width:20%; ">玩法组</th>
											<th style="width:20%;">玩法</th>
											<th style="width:60%;">介绍</th>
										</tr>

										<tr>
											<td rowspan="3">三码</td>
											<td>前三直选复式</td>
											<td class="contLeft">从01-11共11个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前三组选复式</td>
											<td class="contLeft">从01-11中共11个号码中选择3个号码，所选号码与当期顺序摇出的5个号码中的前3个号码相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>前三组选胆拖</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。当期顺序摇出的5个号码中的前3个号码中同时包含所选的1个胆码和2个拖码，顺序不限，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">二码</td>
											<td>前二直选复式</td>
											<td class="contLeft">从01-11共11个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的前2个号码相同，且顺序一致，即中奖。</td>
										</tr>
										<tr>
											<td>前二组选复式</td>
											<td class="contLeft">从01-11中共11个号码中选择2个号码，所选号码与当期顺序摇出的5个号码中的前2个号码相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>前二组选胆拖</td>
											<td class="contLeft">	分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。当期顺序摇出的5个号码中的前2个号码中同时包含所选的1个胆码和1个拖码，顺序不限，即为中奖。</td>
										</tr>


										<tr>
											<td rowspan="2">第一位</td>
											<td>第二位</td>
											<td class="contLeft">从第一位，第二位，第三位任意1个位置或多个位置上选择1个号码，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>第三位</td>
											<td class="contLeft">从01-11共11个号码中选择1个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="8">任选</td>
											<td>任选一中一</td>
											<td class="contLeft">从01-11共11个号码中选择1个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选二中二</td>
											<td class="contLeft">从01-11共11个号码中选择2个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选三中三</td>
											<td class="contLeft">	从01-11共11个号码中选择3个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选四中四</td>
											<td class="contLeft">从01-11共11个号码中选择4个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选五中五</td>
											<td class="contLeft">01-11共11个号码中选择5个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选六中五</td>
											<td class="contLeft">从01-11共11个号码中选择6个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选七中五</td>
											<td class="contLeft">从01-11共11个号码中选择7个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选八中五</td>
											<td class="contLeft">从01-11共11个号码中选择8个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="8">任选胆拖</td>
											<td>任选二中二</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和1个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选三中三</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和2个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选四中四</td>
											<td class="contLeft">	分别从胆码和拖码的01-11中，至少选择1个胆码和3个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和3个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选五中五</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和4个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和4个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选六中五</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和5个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和任意4个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选七中五</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和6个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和任意4个拖码，即为中奖。</td>
										</tr>
										<tr>
											<td>任选八中五</td>
											<td class="contLeft">分别从胆码和拖码的01-11中，至少选择1个胆码和7个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和任意4个拖码，即为中奖。</td>
										</tr>


									</table>
                  <h2 class="mainRightBarTitle ft36 colorY classical">经典玩法</h2>
                  <p>◎单码 - 指第一球、第二球、第三球、第四球、第五球出现的顺序与号码为派彩依据。</p>
                  <p>单码：如现场滚球第一个开奖号码为10号，投注第一球为10号则视为中奖，其它号码视为不中奖。</p>
                  <p>大小：开出的号码大于或等于6为大，小于或等于5为小，开出11为和。 单双：号码为双数叫双，如2、8；号码为单数叫单，如5、9；开出11为和。</p>
                  <p class="ft18 classical_title">◎总和 - 以全部开出的5个号码，加起来的总和来判定。</p>
                  <p>总和大小: 所有开奖号码数字加总值大于30为和大；总和值小于30为和小；若总和值等于30为和。 </p>
                  <p>总和单双: 所有开奖号码数字加总值为单数叫和单，如11、31；加总值为双数叫和双，如42、30。</p>
                  <p>总和尾数大小: 所有开奖号码数字加总值的尾数，大于或等于5为尾大，小于或等于4为尾小。</p>
                  <p class="ft18 classical_title">龙虎:</p>
                  <p>龙：第一球开奖号码大于第五球开奖号码，如第一球开出10，第五球开出7。</p>
                  <p>虎：第一球开奖号码小于第五球开奖号码，如第一球开出3，第五球开出7。</p>
                  <p class="ft18 classical_title">◎选号 - 选号玩法是由1~11号中，选出1~5个号码为一投注组合来进行投注。</p>
                  <p>任选一中一: 投注1个号码与当期开奖的5个号码中任1个号码相同，视为中奖。</p>
                  <p>任选二中二: 投注2个号码与当期开奖的5个号码中任2个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选三中三: 投注3个号码与当期开奖的5个号码中任3个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选四中四: 投注4个号码与当期开奖的5个号码中任4个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选五中五: 投注5个号码与当期开奖的5个号码中5个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选六中五: 投注6个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选七中五: 投注7个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                  <p>任选八中五: 投注8个号码中任5个号码与当期开奖的5个号码相同(顺序不限)，视为中奖。</p>
                  <p>组选前二: 投注的2个号码与当期顺序开出的5个号码中的前2个号码相同，视为中奖。</p>
                  <p>组选前三: 投注的3个号码与当期顺序开出的5个号码中的前3个号码相同，视为中奖。</p>
                  <p>直选前二: 投注的2个号码与当期顺序开出的5个号码中的前2个号码相同且顺序一致，视为中奖。</p>
                  <p>直选前三: 投注的3个号码与当期顺序开出的5个号码中的前3个号码相同且顺序一致，视为中奖。</p>
								</div>
						</div>

						<div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">快三玩法介绍</h2>
									<p class="mt25">
										快3是指以三个号码组合为一注进行的投注，每个投注号码为1-6共六个自然数中的任意一个，一组三个号码的组合称为一注。
									</p>
									<table class="mainRightBarMain bgcolorA mt10 ft12" border="2" cellspacing="2" cellpadding="2">
										<tr>
											<th style="width:20%;">玩法</th>
											<th style="width:60%;">玩法说明</th>
										</tr>

										<tr>
											<td>和值</td>
											<td class="contLeft">	至少选择1个和值（3个号码之和）进行投注，所选和值与开奖的3个号码的和值相同即中奖。</td>
										</tr>
										<tr>
											<td>二同号单选</td>
											<td class="contLeft">	是指对三个号码中两个指定的相同号码和一个指定的不同号码进行投注。</td>
										</tr>
										<tr>
											<td>二同号复选</td>
											<td class="contLeft">开奖号码的任意2位，与您投注的二同号一致即中奖。</td>
										</tr>
										<tr>
											<td>二不同号</td>
											<td class="contLeft">选择2个号码投注，与开奖号码的任意2位一致即中奖</td>
										</tr>
										<tr>
											<td>三同号单选</td>
											<td class="contLeft">对相同的三个号码（111、222、333、444、555、666）中的任意一个进行投注，所选号码开出即中奖。</td>
										</tr>
										<tr>
											<td>三同号通选</td>
											<td class="contLeft">对所有相同的三个号码（111、222、333、444、555、666）进行投注，任意号码开出即中奖。</td>
										</tr>
										<tr>
											<td>三不同号</td>
											<td class="contLeft">至少选择3个不同号码投注，所选号码与开奖号码一致即中奖。</td>
										</tr>
										<tr>
											<td>三连号通选</td>
											<td class="contLeft">对所有3个相连的号码（123、234、345、456）进行投注，任意号码开出即中奖。</td>
										</tr>
									</table>
                  <h2 class="mainRightBarTitle ft36 colorY classical">经典玩法</h2>
                  <p class="ft18 classical_title">玩法</p>
                  <p class="common_color">◎和值</p>
                  <p>以全部开出的三个号码、加起来的总和来判定。 </p>
                  <p>大小：三个开奖号码总和值11~17 为大；总和值4~10 为小；若三个号码相同、则不算中奖。</p>
                  <p>单双：三个开奖号码总和5、7、9、11、13、15、17为单；4、6、8、10、12、14、16为双；若三个号码相同、则不算中奖。</p>
                  <p> 开奖号码总和值为3、4、5、6、7、8、9、10、11、12、13、14、15、16、17 、18时，即为中奖； </p>
                  <p>举例：如开奖号码为1、2、3、总和值为6、则投注「6」即为中奖。</p>
                  <p class="common_color">◎独胆</p>
                  <p>三个开奖号码其中一个与所选号码相同时、即为中奖。 </p>
                  <p>举例：如开奖号码为1、1、3，则投注独胆1或独胆3皆视为中奖。</p>
                  <p>备注：不论当局指定点数出现几次，仅派彩一次(不翻倍)。</p>
                  <p class="common_color">◎豹子</p>
                  <p>豹子：开奖号码三字同号、且与所选择的豹子组合相符时，即为中奖。</p>
                  <p>任意豹子：任意豹子组合、开奖号码三字同号，即为中奖。</p>
                  <p class="common_color">◎两连</p>
                  <p>任选一长牌组合、当开奖结果任2码与所选组合相同时，即为中奖。 </p>
                  <p>举例：如开奖号码为1、2、3、则投注两连12、两连23、两连13皆视为中奖。</p>
                  <p class="common_color">◎对子</p>
                  <p>开奖号码任两字同号、且与所选择的对子组合相符时，即为中奖。 </p>
                  <p>举例：如开奖号码为1、1、3、则投注对子1、1，即为中奖。</p>
								</div>
						</div>

						<div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">3D福彩、排列三玩法介绍</h2>
									<p class="mt25">
										一个3位自然数为投注号码的彩种，投注者从000-999的数字中选择一个3位数进行投注。
									</p>
									<table class="mainRightBarMain bgcolorA mt10 ft12" border="2" cellspacing="2" cellpadding="2">
										<tr>
											<th style="width:20%; ">玩法组</th>
											<th style="width:20%;">玩法</th>
											<th style="width:60%;">介绍</th>
										</tr>

										<tr>
											<td rowspan="2">直选</td>
											<td>直选复式</td>
											<td class="contLeft">从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>直选单式</td>
											<td class="contLeft">手动输入一个3位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="3">组选</td>
											<td>组三</td>
											<td class="contLeft">从0-9中任意选择2个数字组成两注，所选号码与开奖号码相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>组六</td>
											<td class="contLeft">	从0-9中任意选择3个号码组成一注，所选号码与开奖号码相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>混合组选</td>
											<td class="contLeft">	手动输入购买号码，3个数字为一注，开奖号码符合组三或组六均为中奖。</td>
										</tr>


										<tr>
											<td>不定位</td>
											<td>一码不定位</td>
											<td class="contLeft">从0-9中选择1个号码，每注由1个号码组成，只要开奖结果中包含所选号码，即为中奖。</td>
										</tr>

										<tr>
											<td rowspan="8">二星</td>
											<td>前二直选复式</td>
											<td class="contLeft">	从百位和十位上至少各选1个号码，所选号码与开奖号码百位、十位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前二直选单式</td>
											<td class="contLeft">	手动输入一个2位数号码组成一注，所选号码与开奖号码的百位、十位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前二组选复式</td>
											<td class="contLeft">	从0-9中选2个号码组成一注，所选号码与开奖号码的百位、十位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>前二组选单式</td>
											<td class="contLeft">	手动输入购买号码，2个数字为一注，所选号码与开奖号码的百位、十位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选复式</td>
											<td class="contLeft">从十位和个位上至少各选1个号码，所选号码与开奖号码的十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选单式</td>
											<td class="contLeft">手动输入一个2位数号码组成一注，所选号码与开奖号码的十位、个位相同，且顺序一致，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选复式</td>
											<td class="contLeft">从0-9中选2个号码组成一注，所选号码与开奖号码的十位、个位相同，顺序不限，即为中奖。</td>
										</tr>
										<tr>
											<td>后二直选单式</td>
											<td class="contLeft">手动输入购买号码，2个数字为一注，所选号码与开奖号码的十位、个位相同，顺序不限，即为中奖。</td>

										</tr>
										<tr>
											<td rowspan="2">定位胆</td>
											<td>后一</td>
											<td class="contLeft" rowspan="2">	从百位、十位、个位任意1个位置或多个位置上选择1个号码，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
										<tr>
											<td>前一</td>
										</tr>
									</table>
                  <h2 class="mainRightBarTitle ft36 colorY classical">经典玩法</h2>
                  <p class="ft18 classical_title">大小，单双</p>
                  <div>
                    第一球、第二球、第三球：指下注的每一球与开出之号码其开奖顺序及开奖号码相同，视为中奖，如第一球开出号码 8，下注第一球为 8 者视为中奖，其余情形视为不中奖。
                    <p class="common_color">单双大小</p>
                    根据相应单项投注第一球 ~ 第三球开出的球号，判断胜负。
                    <p class="common_color">大小：</p>
                    根据相应单项投注的第一球 ~ 第三球开出的球号大于或等于 5 为大，小于或等于 4 为小。
                    <p class="common_color">单双：</p>
                    根据相应单项投注的第一球 ~ 第三球开出的球号为双数则为双，如 2、6；球号为单数则为单，如 1、3。
                    <p class="ft18 classical_title">总和</p>
                    <p class="common_color">大小：</p>
                    根据相应单项投注的第一球 ~ 第三球开出的球号数字总和值大于或等于 14 为总和大，小于或等于 13 为总和小。
                    <p class="common_color">单双：</p>
                    根据相应单项投注的第一球 ~ 第三球开出的球号数字总和值是双数为总和双，数字总和值是单数为总和单。
                    <p class="ft18 classical_title">三连特殊玩法： 豹子 > 顺子 > 对子 > 半顺 > 杂六</p>
                    <p class="common_color">豹子：</p>
                    开奖号码的百位十位个位数字都相同。如中奖号码为：222、666、888...开奖号码的百位十位个位数字相同，则投注三连豹子者视为中奖，其它视为不中奖。
                    <p class="common_color">顺子：</p>
                    开奖号码的百位十位个位数字都相连，不分顺序（数字9、0、1相连）。如中奖号码为：123、901、321、798...开奖号码的百位十位个位数字相连，则投注三连顺子者视为中奖，其它视为不中奖。
                    <p class="common_color">对子：</p>
                    开奖号码的百位十位个位任意两位数字相同（不包括豹子）。如中奖号码为：001，288、696...开奖号码的百位十位个位有两位数字相同，则投注三连对子者视为中奖，其它视为不中奖。如果开奖号码为三连豹子，则三连对子视为不中奖。
                    <p class="common_color">半顺：</p>
                    开奖号码的百位十位个位任意两位数字相连，不分顺序（不包括顺子、对子）。如中奖号码为：125、540、390、160...开奖号码的百位十位个位有两位数字相连，则投注三连半顺者视为中奖，其它视为不中奖。如果开奖号码为三连顺子、三连对子，则三连半顺视为不中奖。如开奖号码为：123、901、556、233...视为不中奖。
                    <p class="common_color">杂六：</p>
                    不包括豹子、对子、顺子、半顺的所有开奖号码。如开奖号码为：157、268...开奖号码位数之间无关联性，则投注三连杂六者视为中奖，其它视为不中奖。
                    <p class="ft18 classical_title">龙虎和特殊玩法： 龙 > 虎 > 和</p>
                    <p class="common_color">龙：</p>
                    开奖第一球（百位）的号码 大于 第三球（个位）的号码。如：6X2、7X6、9X8...开奖为龙，投注龙者视为中奖，其它视为不中奖。
                    <p class="common_color">虎：</p>
                    开奖第一球（百位）的号码 小于 第三球（个位）的号码。如：1X2、4X6、3X8...开奖为虎，投注虎者视为中奖，其它视为不中奖。
                    <p class="common_color">和：</p>
                    开奖第一球（百位）的号码 等于 第三球（个位）的号码。如：2X2、6X6、8X8...开奖为和，投注和者视为中奖，其它视为不中奖。
                    <p class="common_color">跨度</p>
                    以开奖三个号码的最大差距(跨度)，作为中奖的依据。会员可以选择 0 ~ 9 的任一跨度。 。
                    <p class="ft18 classical_title">独胆</p>
                    会员可以选择 0 ~ 9 的任意一个号码，只要开出的3球中有下注的号码，即为中奖。 。
                  </div>
								</div>
						</div>


						<div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">PK10玩法介绍</h2>
									<p class="mt25">
                    从1到10总共10个数字中任意选取号码，竞猜10部赛车的最终名次。
									</p>
									<table class="mainRightBarMain bgcolorA mt10 ft12" border="2" cellspacing="2" cellpadding="2">
										<tr>
											<th style="width:20%; ">玩法组</th>
											<th style="width:60%;">玩法说明</th>
										</tr>

										<tr>
											<td>前一</td>
											<td class="contLeft">	投注的1个号码与开奖号码中的前1个号码相同且顺序一致，视为中奖。</td>
										</tr>
										<tr>
											<td>前二</td>
											<td class="contLeft">	投注的2个号码与开奖号码中的前2个号码相同且顺序一致，视为中奖。</td>
										</tr>
										<tr>
											<td>前三</td>
											<td class="contLeft">	投注的3个号码与开奖号码中的前3个号码相同且顺序一致，视为中奖。</td>
										</tr>
										<tr>
											<td>定位胆</td>
											<td class="contLeft">从一号位置开始，选择最少一个、最多十个位置，任意1个位置或多个位置上选择1个号码，所选号码与相同位置上的开奖号码一致，即为中奖。</td>
										</tr>
									</table>
                  <h2 class="mainRightBarTitle ft36 colorY classical">经典玩法</h2>
                  <div>
                    <p class="ft18 classical_title">第一名 ~ 第十名</p>
                    车号指定，每一个车号为一投注组合，开奖结果"投注车号"对应所投名次视为中奖，其余情形视为不中奖。
                    <p class="ft18 classical_title">两面</p>
                    指单、双；大、小。
                    单、双：号码为双数叫双，如8、10；号码为单数叫单，如9、5。
                    大、小：开出之号码大于或等于6为大，小于或等于5为小。
                    <p class="ft18 classical_title">龙虎</p>
                    冠　军 龙/虎："第一名"车号大于"第十名"车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。
                    亚　军 龙/虎："第二名"车号大于"第九名"车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。
                    第三名 龙/虎："第三名"车号大于"第八名"车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。
                    第四名 龙/虎："第四名"车号大于"第七名"车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。
                    第五名 龙/虎："第五名"车号大于"第六名"车号视为【龙】中奖、反之小于视为【虎】中奖，其余情形视为不中奖。
                    <p class="ft18 classical_title">冠亚军和</p>
                    <p class="common_color">冠军车号＋亚军车号＝冠亚和值：</p>
                    可能出现的结果为3～19， 投中对应"冠亚和值"数字的视为中奖，其余视为不中奖。
                    <p class="common_color">冠亚和大小：</p>
                    当开奖结果冠军号码与亚军号码的和值大于 11 为大，投注“和大”则视为中奖。
                    当开奖结果冠军号码与亚军号码的和值小于 11 为小，投注“和小”则视为中奖。
                    当开奖结果冠军号码与亚军号码的和值等于 11 视为和（不计算输赢，不退回本金）。
                    <p class="common_color">冠亚和单双：</p>
                    当开奖结果冠军号码与亚军号码的和值为单数如 9、13，投注“和单”则视为中奖。
                    当开奖结果冠军号码与亚军号码的和值为双数如 12、16，投注“和双”则视为中奖。
                    当开奖结果冠军号码与亚军号码的和值等于 11 视为和（不计算输赢，不退回本金）。
                  </div>
								</div>
						</div>

            <div class="mainRightBar fr mt35">

								<div class="mainAcitivity ft14">
									<h2 class="mainRightBarTitle ft36 colorY">六合彩玩法介绍</h2>
									<p class="mt25">
                    单注最高赔付金额10万元，每个账户单期最高赔付金额40万元，平台目前提供香港六合彩、博猫六合彩这两大彩种。
									</p>
                  <div class="row-text">
                    <p>单注最高赔付金额10万元，每个账户单期最高赔付金额40万元，平台目前提供香港六合彩、博猫六合彩这两大彩种。</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>香港六合彩</strong></p>
                    <p>彩票奖期：每周三期（周二、周四、周六晚上）</p>
                    <p>官方开奖时间：21：30</p>
                    <p>截止销售时间：21：15</p>
                    <p>
                      <br></p>
                    <p>
                      <strong style="line-height: 1em;">急速六合彩</strong>
                      <br></p>
                    <p>彩票奖期：每天144期（每隔10分钟一期）</p>
                    <p>首期开奖时间：00：10</p>
                    <p>末期开奖时间：24：00</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>玩法说明</strong></p>
                    <p>
                      <strong>
                        <span style="line-height: 1em;">1. 特码</span></strong>
                      <br></p>
                    <p>香港彩票公司当期开出的最后一位号码为特码。当开出特码与投注号码一致、即视为中奖（其余情况则视为不中奖）。</p>
                    <p>
                      <span style="line-height: 1em;">特A、特B：在六合彩中有“A盘、B盘”的概念，所谓A盘就是采用无返点模式并提高赔率，B盘就是采用高返点模式并降低赔率。这个概念被引用到特码后长被称为“特A、特B”。</span>
                      <br></p>
                    <p>
                      <br></p>
                    <p>
                      <strong>2. 正码</strong></p>
                    <p>正码1：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码1与投注号码一致、即视为中奖（其余情况则视为不中奖）。</p>
                    <p>正码2：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码2与投注号码一致、即视为中奖（其余情况则视为不中奖）。</p>
                    <p>
                      <span style="line-height: 1em;">正码3：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码3与投注号码一致、即视为中奖（其余情况则视为不中奖）。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">正码4：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码4与投注号码一致、即视为中奖（其余情况则视为不中奖）。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">正码5：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码5与投注号码一致、即视为中奖（其余情况则视为不中奖）。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">正码6：香港彩公司当期开出之前6个号码叫正码。第一号为正码1，依次叫正码2、正码3……正码6，不以大小排序。当开出正码6与投注号码一致、即视为中奖（其余情况则视为不中奖）。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">正A、正B：在六合彩中有“A盘、B盘”的概念，所谓A盘就是采用无返点模式并提高赔率，B盘就是采用高返点模式并降低赔。这个概念被引用到这6个正码后长被称为“正A、正B”。</span>
                      <br></p>
                    <p>
                      <br></p>
                    <p>
                      <strong>3. 半波</strong></p>
                    <p>以特码色波和特码单双大小为一个投注组合。当开出的特码出现在其投注组合中，即视为中奖（其余情况则视为不中奖）。若开出特码为49号时，所有投注半波任意一个组合接会被视为和局，并返回全部本金（不派发返点）。</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>4. 生肖</strong></p>
                    <p>特肖：以特码和生肖为一个投注组合。当开出的特码出现在其投注组合中，即视为中奖（其余情况视为不中奖）。</p>
                    <p>一肖：指开出的7个开奖号码中含有投注所属生肖的一个或多个号码，即视为中奖，不论同生肖的号码出现一个或多个，派彩只派一次。</p>
                    <p>六肖：以特码和生肖为一个投注组合。当开出的特码出现在其投注组合中，即视为中奖（其余情况视为不中奖），
                      <span style="line-height: 1em;">本玩法支持复式投注。</span></p>
                    <p>
                      <br></p>
                    <p>
                      <strong>温馨提示</strong></p>
                    <p>依据六合彩惯例每年需向下顺延一次生肖所对应的号码（调整时间为每年的农历初一）。</p>
                    <p>2016猴年对应号码如下：</p>
                    <p>鼠包括： 9,21,33,45</p>
                    <p>牛包括： 8,20,32,44</p>
                    <p>虎包括： 7,19,31,43</p>
                    <p>兔包括： 6,18,30,42</p>
                    <p>龙包括： 5,17,29,41</p>
                    <p>蛇包括： 4,16,28,40</p>
                    <p>马包括： 3,15,27,39</p>
                    <p>羊包括： 2,14,26,38</p>
                    <p>猴包括： 1,13,25,37,49</p>
                    <p>鸡包括： 12,24,36,48</p>
                    <p>狗包括： 11,23,35,47</p>
                    <p>猪包括： 10,22,34,46</p>
                    <p>
                      <br></p>
                    <p>2017鸡年对应号码如下：</p>
                    <p>鼠包括： 10,22,34,46</p>
                    <p>牛包括： 9,21,33,45</p>
                    <p>虎包括： 8,20,32,44</p>
                    <p>兔包括： 7,19,31,43</p>
                    <p>龙包括： 6,18,30,42</p>
                    <p>蛇包括： 5,17,29,41</p>
                    <p>马包括： 4,16,28,40</p>
                    <p>羊包括： 3,15,27,39</p>
                    <p>猴包括： 2,14,26,38</p>
                    <p>鸡包括： 1,13,25,37,49</p>
                    <p>狗包括： 12,24,36,48</p>
                    <p>猪包括： 11,23,35,47</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>5. 尾数</strong></p>
                    <p>
                      <span style="line-height: 1em;">指7个开奖号码中含有所属尾数的一个或多个号码，不论同尾数的号码出现一个或多个，派彩只派一次。</span></p>
                    <p>0尾包括：10，20，30，40</p>
                    <p>1尾包括：01，11，21，31，41</p>
                    <p>2尾包括：02，12，22，32，42</p>
                    <p>3尾包括：03，13，23，33，43</p>
                    <p>4尾包括：04，14，24，34，44</p>
                    <p>5尾包括：05，15，25，35，45</p>
                    <p>6尾包括：06，16，26，36，46</p>
                    <p>7尾包括：07，17，27，37，47</p>
                    <p>8尾包括：08，18，28，38，48</p>
                    <p>9尾包括：09，19，29，39，49</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>6. 总分</strong></p>
                    <p>所有7个开奖号码的数值总和叫做总分。</p>
                    <p>总分大小：所有七个开奖号码的分数总和大于或等于175为总分大；分数总和小于或等于174为总分小。如开奖号码为01、07、15、29、38、46、24，分数总和是160，为总分小。</p>
                    <p>总分单双：所有七个开奖号码的分数总和是单数叫总分单(总单)，如分数总和是103、193；分数总和是双数叫总分双(总双)，如分数总和是108、160。</p>
                    <p>
                      <br></p>
                    <p>
                      <strong>7. 不中</strong></p>
                    <p>五不中：所投注的每五个号码为一注，每注的五个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05则中奖，而投01,02,03,04,06则不中奖，
                      <span style="line-height: 1em;">本玩法支持复式投注。</span></p>
                    <p>
                      <span style="line-height: 1em;">
                        <br></span>
                    </p>
                    <p>
                      <span style="line-height: 1em;">六不中：所投注的每六个号码为一注，每注的六个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05,13则中奖，而投01,02,03,04,06,13则不中奖，</span>
                      <span style="line-height: 1em;">本玩法支持复式投注。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">
                        <br></span>
                    </p>
                    <p>
                      <span style="line-height: 1em;">七不中：所投注的每七个号码为一注，每注的七个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05,13,14则中奖，而投01,02,03,04,06,13,14则不中奖，</span>
                      <span style="line-height: 1em;">本玩法支持复式投注。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">
                        <br></span>
                    </p>
                    <p>
                      <span style="line-height: 1em;">八不中：所投注的每八个号码为一注，每注的八个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05,13,14,15则中奖，而投01,02,03,04,06,13,14,15则不中奖，</span>
                      <span style="line-height: 1em;">本玩法支持复式投注。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">
                        <br></span>
                    </p>
                    <p>
                      <span style="line-height: 1em;">九不中：所投注的每九个号码为一注，每注的九个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05,13,14,15,16则中奖，而投01,02,03,04,06,13,14,15,16则不中奖，</span>
                      <span style="line-height: 1em;">本玩法支持复式投注。</span>
                      <br></p>
                    <p>
                      <span style="line-height: 1em;">
                        <br></span>
                    </p>
                    <p>
                      <span style="line-height: 1em;">十不中：所投注的每十个号码为一注，每注的十个号码中如果没有当期开奖的所有7个号码中的任意一个，则视为中奖；否则视为不中奖。例如开奖号码是：06,07,08,09,10,11,12，若你投的是01,02,03,04,05,13,14,15,16,17则中奖，而投01,02,03,04,06,13,14,15,16,17则不中奖，</span>
                      <span style="line-height: 1em;">本玩法支持复式投注。</span>
                      <br></p>
                  </div>

								</div>
						</div>
					</div>

			</div>
		</div>
		<div>
		</div>
<!--
   <router-link to="/">Go to index</router-link>
   <router-link to="/login">Go to index</router-link>
   <router-link to="/register">Go to index</router-link>-->
  </div>
</template>

<script>
	function inittab(btn,obj,_this){
	let btns = document.getElementById(btn).getElementsByTagName("li"),
			objs = document.getElementsByClassName(obj);
			console.log(btns,objs,_this.showIndex)
			console.log(btns.length,objs.length,_this.showIndex)
			for(let y = 0, lenn = objs.length; y < lenn ;y++){
				console.log(btns[y])
				objs[y].style.display = "none";
				btns[y].className = 'colorJ cursor mt30';

			}
			objs[_this.showIndex].style.display = "block";
			btns[_this.showIndex].className = 'colorJ cursor mt30 litrue';
			for(let i = 0, len = btns.length ; i<len ;i++){
				btns[i].zdindexs = i;
				btns[i].addEventListener("click",function(){
					_this.$router.push('/playDetails#'+this.zdindexs)
				},false)
			}
		}
	import pagefooter from './pagefooter.vue'
	import {activityInit} from '../js/index.js'
	let init =  activityInit();


	export default {
	  name: 'playDetails',
	  data () {
	    return {
	      height: document.documentElement.clientHeight,
	      width: document.documentElement.clientWidth,
	      lottery:[{showName: '登录'}],
	      initColor: localStorage.getItem('_bgIndex')!=='undefined'?localStorage.getItem('_bgIndex'):1,
				showIndex:null,
	    }
	  },
		watch: {
			'$route' (to,form) {
				this.showIndex = location.href[location.href.length-1];
				if(5<this.showIndex || Number(this.showIndex).toString() === 'NaN')this.showIndex = 0;
				inittab('mainLeftBarList', 'mainRightBar',this);
			}
	  },
	  components: {
	    pagefooter
	  },
	  updated () {
		},
	  methods: {},
	  mounted () {
			this.showIndex = location.href[location.href.length-1];
			if(5<this.showIndex || Number(this.showIndex).toString() === 'NaN')this.showIndex = 0;
			inittab('mainLeftBarList', 'mainRightBar',this);
		}


	}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="less">
  .playWarp .banner{
    background-image:url('../img/index/pbanner.jpg');
    height: 138px;
    background-position: center;
  }
  .playWarp .header{position: absolute;left: 50%;top: -65px;margin-left: -94px;}
  .playWarp .mainRightBarTitle{text-align: left;}
  .playWarp .mainRightBarMain{width: 100%;text-align: center;border-right: 1px solid #ccc;border-bottom: 1px solid #ccc;}
  .playWarp .mainRightBarMain th{text-align: center;border-left: 1px solid #ccc;border-top: 1px solid #ccc;padding:3px 0;}
  .playWarp .mainRightBarMain td{border-left: 1px solid #ccc;border-top: 1px solid #ccc;padding:0 5px;}
  .playWarp .contLeft{text-align: left;}
	.playWarp i.closeIcon{font-size: 40px;margin-top: 0;float: right;}
	.playWarp .mt25{margin-top: 25px;}
	.playWarp .mr15{margin-left: 15px;}
	.playWarp .mt10{margin-top: 10px;}

	.playWarp .activityWarp{
		padding:0px 0 20px 0;
	}
	.playWarp .activityMain{
		position:relative;
		border: 1px solid #ecf0f4;
		border-top: 0;
		min-height: 620px;
	}
	.playWarp .contMain{
		width:100%;
		padding-bottom: 20px;
	}
	.playWarp .mainLeftBar{
		width:100%;
	}

	.playWarp .mainLeftBarIcon{
	  position: absolute;
    left: 50%;
    top: -30px;
    margin-left: -24px;
    background: #ededed;
    width: 48px;
    height: 48px;
    line-height: 42px;
    border-radius: 24px;
    padding: 2px;
    padding-top:3px;
	}
	.playWarp .mainLeftBarTxt{
		margin-top: 30px;
    color: #f94e3f;
	}
	.playWarp .mainLeftBarList{
		width:90%;
		float: left;
		margin-left: 5%;
	}
  .playWarp .mainLeftBarList li.litrue .mainLeftBarIcon{
    padding-top:3px;
  }
  .playWarp .mainLeftBarList li.litrue .mainLeftBarIcon{

  }
	.playWarp .mainLeftBarList li{
		float: left;
		border-top: 1px solid #ccc;
		width: 16.6%;
		padding-top: 20px;
		position: relative;
	}

	.playWarp .mainRightBar{
		width: 90%;
		margin-right: 5%;
	}
	.playWarp .mainAcitivity{
		text-align: left;
	}

  .playWarp .classical_title{
    margin:10px 0
  }
  .playWarp h2.classical{
    margin:20px 0
  }
  .playWarp table{
    border-collapse: inherit;
  }
</style>
